[
  {
    "name": "Broccoli rabe",
    "synonyms": "Spring rabe, Brassicaceae, broccoli, raab rapini",
    "description": "An Italian favorite with a somewhat bitter taste, this fast-growing, cool-season annual forms loose flower heads similar to broccoli in the axils of lower leaves.",
    "height": "1 to 1.5 feet",
    "care": "difficult",
    "maintenance": "Grow similar to broccoli. Direct seed from early spring to late summer, about 1 inch apart and ¼ to ½ inch deep in rows 18 to 24 inches apart. Thin to 4 to 6 inches apart.
    Use floating row cover to protect from insects.",
    "earlyCrop": "May",
    "lateCrop": "August",
    "image": "https://www.google.com/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&cad=rja&uact=8&ved=2ahUKEwjC0Mn5zYPcAhXYITQIHe4oA-cQjRx6BAgBEAU&url=https%3A%2F%2Fwww.npr.org%2Ftemplates%2Fstory%2Fstory.php%3FstoryId%3D127561145&psig=AOvVaw32xb9dz0S1stjacssm02HD&ust=1530730547580556",
  },
  {
    "name": "Asparagus",
    "description": "Among the earliest crops in spring, plantings of this hardy perennial can last for decades if well cared for, and the fine foliage makes it a natural for edible landscaping. The tender spears are tastiest when eaten as soon as possible after harvest.",
    "height": "5 to 9 feet",
    "spread": "2 to 2.5 feet",
    "care": "difficult",
    "maintenance": "Carefully consider site before planting this long-lived perennial. Test soil and apply phosphorus, potassium and lime as indictated before planting. Avoid frost pockets as late killing frosts will damage spears.
    Plant crowns 4 to 6 weeks before average last frost, 18 to 24 inches apart in trenches 8 inches deep. (5 inches deep for Jersey series cultivars.) Spread roots in bottom of trench and cover with 1 to 2 inches of soil. Gradually cover with more soil as the plants grow.

    Do not cut back ferns in fall until they die naturally.

    For highest yields, plant all-male hybrids, such as the Jersey series from Rutgers University (Jersey Giant, Jersey King, Jersey Knight). If using older varieties, such as Martha Washington, you can identify the less productive female plants at flowering and replace them with male plants. The flowers on male plants are larger and longer than the female flowers, have six stamens and a small nonfunctional pistil. The female flowers have six small nonfunctional pistils and a well developed, three-lobed stamen.

    Water during dry spells during the first year. Do not overwater as plants don’t tolerate water-logged soils.

    To blanch asparagus, carefully hill soil over spears or grow under opaque buckets or row covers.

    Midsummer mulching with hay, straw, leaves or grass clippings helps control weeds and keep soil from drying out. (Be careful not to bring in weed seeds with your mulch.) Regular applications of compost or well-rotted manure provide a steady source of nutrients.

    Weeds can be challenging. Keep plantings well cultivated and mulched to prevent weeds from getting established. Mulch heavily around plantings to keep spreading weeds such as quackgrass from invading. While plants are salt-tolerant, the old practice of using salt to kill weeds is not recommended. With older varieties that are not all-male, weed out volunteer plants from females that set seed.",
    "earlyCrop": "February",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fblog.growjoy.com%2Fwp-content%2Fuploads%2F2014%2F01%2Fasparagus_plants.jpg&imgrefurl=http%3A%2F%2Fblog.growjoy.com%2F2011%2F12%2F19%2Fjust-about-everything-about-asparagus-2%2F&docid=S3bLJRctgeEXnM&tbnid=i78Ji9-fP2pjwM%3A&vet=10ahUKEwi-qMXJ9YPcAhXLr1QKHUDGCkUQMwjAASgYMBg..i&w=225&h=316&bih=752&biw=1423&q=asparagus%20garden&ved=0ahUKEwi-qMXJ9YPcAhXLr1QKHUDGCkUQMwjAASgYMBg&iact=mrc&uact=8"
  },
  {
    "name": "Bush Bean",
    "synonyms": "French bean, filet bean, haricot, green bean, wax bean, string bean",
    "description": "You can harvest this staple of the vegetable garden as snap beans, shell beans or dry beans. They are extremely easy to grow, but if your garden is small, consider planting pole beans. They yield two to three times more from the same space.",
    "height": "1 to 3 feet",
    "spread": "1 to 2 feet",
    "care": "easy",
    "maintenance": "Do not plant until danger of frost has passed and soil has warmed. Germination is poor when soil temperature is below 60 F. Cold air temperatures (even above freezing) can injure plants and reduce yields.
    Plant seed one inch deep (deeper if soil is dry), about 2 inches apart, in rows 18 to 36 inches apart.

    Soaking beans to hasten germination may damage seeds. Do not start seed inside.

    For a steady supply of beans, make successive plantings until mid- to late July.

    Relay-crop beans following harvest of cool-season crops, such as lettuce, spinach and peas.

    Beans require even moisture - about 1 inch per week - especially when flowering and developing pods. If you water, avoid wetting foliage, which encourages disease. Water early in the day so foliage dries quickly. Mulch after second set of true leaves develops to help retain moisture.

    Do not use nitrogen fertilizers. Inoculating seed with rhizobium bacteria may increase yields, especially in soils where beans have not been grown before.

    Pod set is often poor when temperatures exceed 90 F.

    Deformed pods may be the result of lack of moisture, poor soil fertility or insect damage during blooming.

    A three-year rotation helps reduce some diseases.",
    "earlyCrop": "May",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fcdn8.bigcommerce.com%2Fs-q83qdckkjh%2Fimages%2Fstencil%2F1024x1024%2Fproducts%2F261%2F2810%2FFrench-White-Garden-Bean1BC__39443.1512171422.jpg%3Fc%3D2&imgrefurl=https%3A%2F%2Fstore.underwoodgardens.com%2FFrench-White-Garden-Bush-Bean-Phaseolus-vulgaris%2Fproductinfo%2FV1476%2F&docid=m55KZ6npH_5m7M&tbnid=7LfuG5zW1UdKPM%3A&vet=10ahUKEwiIlteA0IPcAhWJJDQIHSWHDK4QMwi8ASgeMB4..i&w=1000&h=1000&bih=752&biw=1409&q=bush%20bean%20garden&ved=0ahUKEwiIlteA0IPcAhWJJDQIHSWHDK4QMwi8ASgeMB4&iact=mrc&uact=8",
  },
  {
    "name": "Beets",
    "description": "Easy-to-grow beets do double-duty in the kitchen, producing tasty roots for baking, boiling or sautéing and fresh greens to boil or steam. Plant them early for top quality and best flavor. (Fluctuating weather can reduce quality and create white zone rings in the roots.) Some varieties have red stems and venation in the leaves, making them a natural for edible landscaping.",
    "height": ".5-1.5 feet",
    "spread": "1 to 1.5 feet",
    "care": "easy",
    "maintenance": "Plant in early spring, as soon as you can work the soil, ¾ inch deep and 1 inch apart in rows 12 to 18 inches apart.   For continuous harvest, make successive plantings every three weeks until midsummer. For winter storage, sow crop about 10 weeks before heavy freeze.
    The wrinkled “seedball” usually contains two to four viable seeds, making it necessary to thin to 3- to 4-inch spacings if you plan to harvest young, small or cylindrical-shaped roots, or 6-inch spacings for larger roots for winter storage.

    Begin thinning when seedlings are about 4 to 5 inches tall, and eat the thinnings. Cut rather than pull plants when thinning to avoid disturbing roots of other plants.

    Some “monogerm” varieties have only one seed per fruit. Some seed companies remove seeds from the seedball.

    Unlike most root crops, beets can be started inside or in cold frames and transplanted into the garden.

    Use floating row covers to discourage insects early in the season.

    Keep well-weeded. Competition and uneven watering can make beets stringy and tough.

    Beets are closely related to Swiss chard and spinach. Avoid following these crops in rotation.

    Beets tolerate average to low fertility. Too much nitrogen will encourage top growth at the expense of root development.

    Best color and flavor develop under cool conditions and bright sun. When beets mature in warm weather, they are lighter colored, have less sugar and have more pronounced color zoning in the roots. Fluctuating weather conditions produce white zone rings in roots.

    Beets are biennials. Normally, they produce an enlarged root during their first season. Then after overwintering they produce a flower stalk. If they experience two to three weeks of temperatures below 45 F after they have formed several true leaves during their first season, a flower stalk may grow prematurely. Many newer varieties are less sensitive to this problem.",
    "earlyCrop": "March",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.mydeliciousblog.com%2Fwp-content%2Fuploads%2F2017%2F03%2FGarden-Beets.jpg&imgrefurl=http%3A%2F%2Fwww.mydeliciousblog.com%2Froasted-beet-basil-salad%2F&docid=adN7oqqJdyPO2M&tbnid=JQY1lX9COd1XDM%3A&vet=10ahUKEwih7sOu0IPcAhXfIjQIHUebBIoQMwhPKAIwAg..i&w=1800&h=1350&bih=752&biw=1409&q=beets%20garden&ved=0ahUKEwih7sOu0IPcAhXfIjQIHUebBIoQMwhPKAIwAg&iact=mrc&uact=8"
  },
  {
    "name": "Pak choy",
    "synonyms": "bok choy",
    "description": "No matter how you spell it, pak choy’s mild flavor is a must for stir fries. It’s not as finicky about heat and cold as Chinese cabbage, and the striking white petioles and green leaves make it a must for edible landscaping.",
    "height": "1 to 2 feet",
    "spread": "1 to 1.5 feet",
    "care": "difficult",
    "maintenance": "While not as sensitive to heat and cold as Chinese cabbage, spring crops may bolt prematurely if young plants are exposed to frost or a week of nighttime temperatures below 50 F. Wait until after last frost date to direct seed or transplant out.
    Start transplants inside 4 to 6 weeks before last frost date. Transplant 6 to 12 inches apart in rows 18 to 30 inches apart. Use the closer spacings for smaller varieties.

    Plant direct-seeded spring crops ¼ to ½ inch deep and about 1 inch apart in rows 18 to 30 inches apart. Thin to 6- to 12-inch spacings. Use thinnings in salads.

    For fall crops, direct seed ¼ to ½ inch deep in rows 18 to 30 inches apart in summer. Thin to 6- to 12- inch spacings. Or set transplants out at 6- to 12-inch spacings 4 to 6 weeks before first frost.

    Mulch fall crops heavily and provide adequate moisture to avoid premature bolting.",
    "earlyCrop": "April",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fi0.wp.com%2Fwww.goodwholefood.com%2Fwp-content%2Fuploads%2F2015%2F11%2FBok-Choy.jpg&imgrefurl=http%3A%2F%2Fwww.goodwholefood.com%2Fhealth-benefits-of-bok-choy%2F&docid=wCHMV2ptslbVTM&tbnid=8pqelE0fsB-QDM%3A&vet=10ahUKEwjeqPnW0IPcAhXrFzQIHULVDeAQMwjCAig_MD8..i&w=672&h=535&bih=752&biw=1409&q=bok%20choy&ved=0ahUKEwjeqPnW0IPcAhXrFzQIHULVDeAQMwjCAig_MD8&iact=mrc&uact=8"
  },
  {
    "name": "Broccoli",
    "synonyms": "Brassicaceae",
    "description": "This cool-season crop grows best when daytime temperatures are in the 60s F. Grow in both spring and fall, but avoid mid-summer crops as hot weather can cause premature bolting. Romanesco types are especially handsome choices for edible landscaping.",
    "height": "2 to 3 feet",
    "spread": "2 to 3 feet",
    "care": "moderate",
    "maintenance": "Sow seeds indoors 6 to 8 weeks before average last spring frost. Keep soil warm (about 75 F), until germination. Then keep plants around 60 F. Provide direct sun so plants don’t get leggy. When plants are 4 to 6 weeks old, transplant into garden 12 to 20 inches apart.
    Use wide spacings if you want to harvest large central heads. Closer spacings will produce smaller central heads. But if you harvest secondary heads you will get a greater total yield from the closer spacings.

    Larger, older transplants are more likely to bolt when exposed to cool temperatures in the garden. Transplant when plants have four or five true leaves.

    Some cultivars will form small “button” heads when the weather turns warm following a 10-day stretch when high temperatures only reach the 40s F.

    Can be direct-seeded as soon as you can work the soil. Will germinate at soil temps as low as 40 F. Plant ½ to ¾ inch deep, about 3 inches apart. Thin to final spacings.

    Direct seed in midsummer for fall crop, or start transplants in late May and transplant in late June or early July.

    In Zone 7 and warmer, fall broccoli crops will often overwinter.

    Use low nitrogen fertilizer at planting. Too much nitrogen fertilizer may cause hollow stems.

    Plants have shallow root systems. Avoid even shallow cultivation. Mulch to protect roots, reduce weed competition and conserve moisture.

    Use floating row covers to help protect from early insect infestations.

    To help reduce disease, do not plant broccoli or other cole crops in the same location more than once every three or four years.",
    "earlyCrop": "May",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fgetbusygardening.com%2Fwp-content%2Fuploads%2F2017%2F03%2Forganic-broccoli-growing-in-my-vegetable-garden.jpg&imgrefurl=https%3A%2F%2Fgetbusygardening.com%2Fgrowing-broccoli-from-seed%2F&docid=bXbwHl3h2cgYQM&tbnid=r3y3NjVF95_bkM%3A&vet=10ahUKEwj6_JOB0YPcAhUVCDQIHQfmCbQQMwiVASgLMAs..i&w=640&h=422&bih=752&biw=1409&q=broccoli%20garden&ved=0ahUKEwj6_JOB0YPcAhUVCDQIHQfmCbQQMwiVASgLMAs&iact=mrc&uact=8"
  },
  {
    "name": "Brussels sprouts",
    "description": "This cool-season crop is most flavorful after it is “kissed” by frost. Keep plantings moist and well-mulched during the heat of summer, and you will be rewarded with sprouts until Christmas or beyond.",
    "height": "2 to 3 feet",
    "spread": "1.5 to 2 feet",
    "care": "moderate",
    "maintenance": "Grow in summer for fall harvest, similar to a fall cabbage or broccoli crop.  Direct seed about 4 months before expected fall frost. Plant seed 3 to 4 inches apart, ¼ to ½ inch deep in rows about 30 inches apart. Thin plants to about 18 inches apart. Start transplants in late May and transplant in late June or early July. Space plants 18 to 24 inches apart. Plants have shallow root systems. Avoid even shallow cultivation. Mulch to protect roots, reduce weed competition and conserve moisture. Use floating row covers to help protect from early insect infestations. To help reduce disease, do not plant Brussels sprouts or other cole crops in the same location more than once every three or four years.",
    "earlyCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fcdn.territorialseed.com%2Fimages%2Fuploads%2F16702_8696_large.jpg&imgrefurl=http%3A%2F%2Fwww.territorialseed.com%2Fproduct%2FIgor-Brussels-Sprouts-Seed%2Forganic-brussels-sprouts-seed&docid=sI-AWbDmuqI7kM&tbnid=rbkfO0qjG4fipM%3A&vet=10ahUKEwjA2Yml0YPcAhUVPH0KHbQAD64QMwjSASgIMAg..i&w=400&h=400&bih=752&biw=1409&q=brussel%20sprouts%20garden&ved=0ahUKEwjA2Yml0YPcAhUVPH0KHbQAD64QMwjSASgIMAg&iact=mrc&uact=8"
  },
  {
    "name": "Carrots",
    "description": "Careful attention to the soil makes these Vitamin A-rich roots a snap to grow. Plant in deep, stone-free soil (a raised bed is great) with a fine surface. Thin and weed carefully, and mulch to keep soil cool.",
    "care": "easy",
    "maintenance": "Plant in spring, 2 to 3 weeks before last frost, ½ inch deep, ½ inch apart, in rows 12 to 24 inches apart. Deeply worked soil with fine, weed-free seedbed will greatly improve chances of successful crop.
    Carrots are slow to germinate (1 to 3 weeks), and often germinate unevenly over a period of several weeks. To speed germination, water lightly daily if soil is dry.

    Thinning is critical to reduce competition from neighboring plants. Thin to 1- to 4-inch spacings (depending on size of root desired) before plants are 2 inches tall. Cutting rather than pulling reduces disturbance of the remaining plants.

    To improve germination in dry weather: Make a small furrow, about 2 inches deep. Plant seed and cover with about ½ inch of soil. Cover furrow with a board to retain soil moisture until seeds germinate.

    Tip: Sow radishes in the same row. They germinate quickly, break the soil crust, and mark the row. Thin and/or harvest radishes before they compete with carrots.

    Use seed tape or pelleted seed for more even spacings and less thinning. Or mix seed in roughly equal proportions with sand, fine vermiculite, or dried coffee grounds.

    Mulch to keep soil cool, conserve moisture and to keep exposed shoulders from turning green and bitter. Another option is to hill soil over the shoulders.

    Make additional plantings every three weeks through midsummer for continuous supply and fall harvest. Sowing in very early spring is possible, but some varieties will bolt if temperatures are too cold. Plant crops for fall harvest about 10 to 12 weeks before first frost.

    Root quality is best when soil temperatures are 60 F to 70 F. The shape of the root is determined within the first few weeks after germination when the new plant extends its taproot deep into the soil. If it encounters obstacles (such as rocks or high water table) or is damaged, shape and quality of the root will suffer.

    To prevent diseases, don’t plant carrots in the same spot more than once every 3 years.",
    "earlyCrop": "March",
    "lateCrop": "September",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fgrowingtogether.areavoices.com%2Ffiles%2F2017%2F09%2Fcarrot-1.jpg&imgrefurl=https%3A%2F%2Fgrowingtogether.areavoices.com%2F2018%2F03%2F09%2Fbest-garden-carrots-for-flavor-and-sweetness%2F&docid=MZyJLBG06iNCJM&tbnid=VGgfgSdNB-BqRM%3A&vet=10ahUKEwiwirbN0YPcAhXiFzQIHYnnCAEQMwh7KAkwCQ..i&w=625&h=398&bih=752&biw=1409&q=carrots%20garden&ved=0ahUKEwiwirbN0YPcAhXiFzQIHYnnCAEQMwh7KAkwCQ&iact=mrc&uact=8"
  },
  {
    "name": "Cabbage",
    "synonyms": "Brassicaceae",
    "description": "This cool-season crop grows best when daytime temperatures are in the 60s F. Direct-seed or transplant spring crops for fresh use in summer. Plant fall crops for winter storage or sauerkraut.",
    "height": "1 to 2 feet",
    "spread": "1.5 to 3 feet",
    "care": "moderate",
    "maintenance": "Sow seeds indoors 6 to 8 weeks before average last spring frost. Keep soil warm (about 75 F) until germination. Then keep plants around 60 F. Provide direct sun so plants don’t get leggy. When plants are 4 to 6 weeks old, transplants into garden 12 to 24 inches apart, in rows 18 to 34 inches apart. Use closer spacings for smaller, early varieties, wider spacings for larger, late-season varieties.
    Can be direct seeded as soon as you can work the soil. Will germinate at soil temps as low as 40 F. Plant ½ to ¾ inch deep, about 3 inches apart. Thin to final spacings.

    Direct seed in summer for fall crop, or start transplants in late May and transplant in late June or early July.

    Plants have shallow root systems. Avoid even shallow cultivation. Mulch to protect roots, reduce weed competition and conserve moisture.

    Use floating row cover to protect crop from early pests.

    When heads are mature, they are prone to splitting in response to any stress or a rain following a dry period. Avoid splitting by choosing varieties that resist splitting, spacing plants close together (8 to 12 inches for early varieties, 12 to 16 inches for later varieties), using shovel to sever roots on one side about 6 inches from the plant, or twisting plants after heads have firmed to break some of the roots.

    To help reduce disease, do not plant cabbage or other cole crops in the same location more than once every three or four years.",
    "earlyCrop": "March",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fplantinstructions.com%2Fwp-content%2Fuploads%2F2017%2F05%2Fcabbage-in-garden-1024x768.jpg&imgrefurl=https%3A%2F%2Fplantinstructions.com%2Fvegetables%2Fhow-to-grow-cabbage-from-seeds%2F&docid=3R5j8gmO74hZ6M&tbnid=61agwK5jpoBCdM%3A&vet=10ahUKEwia2Pq50oPcAhWmIDQIHVA9BvsQMwi4ASgKMAo..i&w=1024&h=768&bih=752&biw=1409&q=cabbage%20garden&ved=0ahUKEwia2Pq50oPcAhWmIDQIHVA9BvsQMwi4ASgKMAo&iact=mrc&uact=8"
  },
  {
    "name": "Cauliflower",
    "synonyms": "Brassicaceae",
    "description": "The most finicky and difficult of the cole (cabbage family) crops to grow, cauliflower flourishes when temperatures are moderate. Purple (left), orange and yellow-green colored varieties make good addition to flower gardens.",
    "height": "1 to 2 feet",
    "spread": "1.3 to 3 feet",
    "care": "difficult",
    "maintenance": "Most finicky of the cole (cabbage family) crops. Heads will not develop properly in hot or dry weather, so timing is crucial. Will tolerate cold as well as other cole crops in spring, but mature heads are not resistant to hard freezes.
    Sow seeds indoors 4 to 6 weeks before average last spring frost. Keep soil warm (about 75 F), until germination. Then keep plants around 60 F. Provide direct sun so plants don’t get leggy. When plants are 4 to 6 weeks old, transplant into garden 15 to 24 inches apart in rows 24 to 36 inches apart. Wait until soil temperature is 50 F or above and danger of frost is past before transplanting.

    Larger, older transplants are more likely to bolt when exposed to cool temperatures in the garden. Transplant when plants have four or five true leaves.

    Some cultivars will form small “button” heads when the weather turns warm following a 10-day stretch when high temperatures only reach the 40s F.

    Direct seeding is more difficult than with other cole crops, especially in spring. For fall crops, plant seed in late-spring early summer ½ to ¾ inch deep, about 3 inches apart. Thin to final spacings. Or start transplants in late May and transplant in late June or early July.

    Plants have shallow root systems. Avoid even shallow cultivation. Mulch to protect roots, reduce weed competition and conserve moisture.

    To preserve the white color of the curd, use string or rubber bands to secure outside leaves over the head when it is about 2 to 3 inches in diameter. From tying to harvest may take less than a week in summer or as long as a month in fall.

    Too much sun, heat or nitrogen fertilizer can cause “ricey” heads where the curd separates into small, rice-like grains.",
    "earlyCrop": "March",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.gardening.cornell.edu%2Fhomegardening%2Fimages%2Fgarden%2Fphotos_garden%2FBrassicaceae%2FBrassica%2Foleracea_var_botrytis_%2528Cauliflower%2529%2Fwhole.jpg&imgrefurl=http%3A%2F%2Fwww.gardening.cornell.edu%2Fhomegardening%2Fscene595b.html&docid=QH_vlcdf4d2IaM&tbnid=_wFoRjPj_5BaNM%3A&vet=10ahUKEwjnpu6W04PcAhXfGjQIHVTLB5EQMwiDASgQMBA..i&w=500&h=350&bih=752&biw=1409&q=cauliflower%20garden&ved=0ahUKEwjnpu6W04PcAhXfGjQIHVTLB5EQMwiDASgQMBA&iact=mrc&uact=8"
  },
  {
    "name": "Celery",
    "description": "Perhaps the most difficult vegetable to grow in many areas, this long-season crop must be started inside. Seeds are slow to germinate, and if transplanted outside too early, plants will bolt in response to cold. Also requires consistent moisture and dislikes heat.",
    "care": "difficult",
    "maintenance": "Seeds need light to germinate, so don’t cover seed deeply. Keep soil moist and warm (about 70 F to 75 F) until seeds germinate in 2 to 3 weeks. After germination, grow inside in a cool location (about 60 F to 70 F). Thin to one seed per cell.
    Plants will withstand light frost, but 10 days with night temperatures below 40 and days below 55 F can cause bolting. So harden plants by reducing water, not lowering temperature.

    Set out transplants 6 to 12 inches apart, rows 18 to 36 inches apart, about 2 weeks before average last frost.

    Plants are shallow-rooted and require consistent moisture. Lack of water will make stalks fibrous and bitter. Mulch to retain moisture, suppress weeds and avoid disturbing roots when cultivating.

    For a milder flavor, blanch by wrapping stalks two weeks before harvest with paper, a cardboard milk carton or other material.",
    "earlyCrop": "March",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.podgardening.co.nz%2Fimg%2Fproducts%2Fvegetables%2Fcelery%2Fcelery-cat-cheryl_hero.jpg&imgrefurl=http%3A%2F%2Fwww.podgardening.co.nz%2Fcelery.html&docid=b3pvgtWA01UHLM&tbnid=yEqRdGQJZWdZUM%3A&vet=10ahUKEwi27e2104PcAhUgIjQIHTsiAdQQMwhnKAIwAg..i&w=900&h=602&bih=752&biw=1409&q=celery%20garden&ved=0ahUKEwi27e2104PcAhUgIjQIHTsiAdQQMwhnKAIwAg&iact=mrc&uact=8"
  },
  {
    "name": "Eggplant",
    "description": "Dramatic foliage and colorful fruits (white, green and other colors in addition to the usual deep purple) make this heat-loving annual a good choice for ornamental beds as well as vegetable gardens. Needs two or more months with night-time temperatures near 70 F for good fruit production.",
    "care": "moderate",
    "height": "2 to 4 feet",
    "spread": "2 to 4 feet",
    "maintenance": "Start inside about 6 weeks before last frost date (or about 8 weeks before expected transplanting). Plant 1/4 inch deep in flats or cell-type containers. Keep soil warm (about 80 F to 90 F if possible) until emergence. Eggplant will not germinate in cool soil.
    Harden off plants carefully before transplanting by reducing temperature and water.

    Wait until weather has settled, all chance of frost has passed and soil is in the 60s F before transplanting, perhaps 2 to 3 weeks after the average last frost date. Cool conditions can weaken plants. Frost will kill them.

    Consider using raised beds or black plastic mulch to warm soil and speed early-season growth. If using organic mulches to help retain moisture, do not apply until the soil has warmed.

    Set transplants 18 to 24 inches apart in rows 30 to 36 inches apart.

    Use row covers to protect plants from pests.

    If season is cool, fruit set may be inconsistent. Plants with heavy fruit set benefit from staking.

    Eggplants are heavy feeders, but avoid high-nitrogen fertilizers. They may encourage lush foliage growth at the expense of fruit.

    Pinch off blossoms 2 to 4 weeks before first expected frost so that plants channel energy into ripening existing fruit, not producing new ones.

    To help reduce disease, do not plant eggplants or other tomato-family crops in the same location more than once every three or four years.",
    "earlyCrop": "April",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fs-media-cache-ak0.pinimg.com%2Foriginals%2F2e%2Fe1%2Ff2%2F2ee1f2ac0f9796308efc2aa0a5eafde5.jpg&imgrefurl=https%3A%2F%2Fwww.pinterest.ca%2Fpin%2F12947917657514663%2F&docid=tACTDLzwZt78IM&tbnid=CPG2j9YKX4s2_M%3A&vet=10ahUKEwjHhc7c04PcAhUsITQIHfUHBAcQMwjvAShDMEM..i&w=616&h=462&itg=1&bih=752&biw=1409&q=eggplant%20garden&ved=0ahUKEwjHhc7c04PcAhUsITQIHfUHBAcQMwjvAShDMEM&iact=mrc&uact=8"
  },
  {
    "name": "Garlic",
    "description": "Easy to grow and productive - a pound of cloves can produce 7 to 10 pounds of garlic - the “stinking rose” needs rich, well-drained soil, full sun and excellent weed control.",
    "care": "easy",
    "height": "1 to 2 feet",
    "spread": "0.5 to 1 feet",
    "maintenance": "Seeds need light to germinate, so don’t cover seed deeply. Keep soil moist and warm (about 70 F to 75 F) until seeds germinate in 2 to 3 weeks. After germination, grow inside in a cool location (about 60 F to 70 F). Thin to one seed per cell.
    Plants will withstand light frost, but 10 days with night temperatures below 40 and days below 55 F can cause bolting. So harden plants by reducing water, not lowering temperature.

    Set out transplants 6 to 12 inches apart, rows 18 to 36 inches apart, about 2 weeks before average last frost.

    Plants are shallow-rooted and require consistent moisture. Lack of water will make stalks fibrous and bitter. Mulch to retain moisture, suppress weeds and avoid disturbing roots when cultivating.

    For a milder flavor, blanch by wrapping stalks two weeks before harvest with paper, a cardboard milk carton or other material.",
    "earlyCrop": "September",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fwww.ruralintelligence.com%2Fimages%2Fstyle%2FOctober-12-Growing-Garlic.jpg&imgrefurl=https%3A%2F%2Fwww.ruralintelligence.com%2Fstyle_section%2Fstyle_articles_garden%2Fgarden_growing_garlic&docid=af1I_9fQNBzDzM&tbnid=VxmDObNLuZPf-M%3A&vet=10ahUKEwj9x7C11IPcAhXFKH0KHepfD38QMwiPASgLMAs..i&w=440&h=330&bih=752&biw=1409&q=garlic%20garden&ved=0ahUKEwj9x7C11IPcAhXFKH0KHepfD38QMwiPASgLMAs&iact=mrc&uact=8"
  },
  {
    "name": "Kale",
    "synonyms": "Brassicaceae",
    "description": "The tender young leaves from these fast-growing plants can be eaten raw, or cooked for soup or stir fries. Very cold hardy, harvest can continue right through snow. Many colored varieties are a fine addition to ornamental plantings as well as spectacular garnishes.",
    "care": "easy",
    "height": "1.5 to 3 feet",
    "spread": "1 to 3 feet",
    "maintenance": "Direct seed about three months before expected fall frost. Plant seeds ¼ to ½ inch deep, 1 inch apart in rows 18 to 30 inches apart. Thin to 12- to 18-inch spacings. Eat or transplant thinnings.
    Similar to cabbage and other cole crops, you can also set out transplants in spring 4 to 6 weeks before average last frost, 12 inches apart, rows 18 to 24 inches apart.

    Doesn't seem to be as troubled by pests as most other cole crops. Use floating row covers to help protect from early insect infestations.

    To help reduce disease, do not plant kale or other cole crops in the same location more than once every three or four years.",
    "earlyCrop": "March",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.alafarmnews.com%2Fafcfarmnews%2Fimages%2Fstories%2F0912%2F0912_garden_kale.jpg&imgrefurl=http%3A%2F%2Fwww.alafarmnews.com%2Findex.php%2Farchiveshomepage%2F29-how-s-your-garden%2F3966-hows-your-garden&docid=c4W-FFjgCmyeHM&tbnid=mbJg5HRkJraqhM%3A&vet=10ahUKEwiFy6LS1IPcAhVNCDQIHeXoAKoQMwioASgTMBM..i&w=701&h=526&bih=752&biw=1409&q=kale%20garden&ved=0ahUKEwiFy6LS1IPcAhVNCDQIHeXoAKoQMwioASgTMBM&iact=mrc&uact=8"
  },
  {
    "name": "Onion",
    "synonyms": "scallions, green onion",
    "description": "Whether harvested early for scallions (green onions), for summer meals, or winter storage, onions need rich, well-drained soil and good weed control. Tightly spaced green onions fit well in ornamental plantings.",
    "care": "moderate",
    "height": "1 to 3 feet",
    "spread": ".5 to 1 feet",
    "maintenance": "Can be direct-seeded, grown from transplants started inside, or from sets -- small bulbs about ½-inch in diameter grown from seed the previous season.
    Choose a weed-free, well-drained location. Raised beds are ideal. Onions are good for intercropping with other garden plants, especially early-maturing spring greens. Do not plant where other onion family crops have been grown in the past 3 years.

    Direct-seeding in the garden may not allow enough time for long-season varieties to mature, but is fine for shorter-season varieties or for scallions - onions harvested before the bulb forms.

    Direct-seed in spring when the soil reaches 50 F. Plant seed ¼ inch deep, ½ inch apart, in rows 12 to 18 inches apart. Thin to 4-inch spacings for large bulbs, 2-inch spacings for smaller bulbs but higher yields, or 1-inch spacings for scallions.

    Start transplants inside about 8 to 10 weeks before last frost date. Plant 4 or 5 seeds in each cell, or seed in flats ¼ inch deep and ½ inch apart. If tops grow too tall and begin to droop, trim back to about 3 inches tall with scissors. After hardening off, transplant 2 to 4 weeks before last frost date. Space 4 inches apart for large bulbs, 2 inches apart for smaller bulbs, or 1 inch apart for scallions.

    From sets:   Choose bulbs no larger than ¾ inch in diameter. Large bulbs are more prone to bolting. Plant sets about 1 inch deep 2 to 4 weeks before last frost date. Space 4 inches apart for large bulbs or 2 inches apart for smaller bulbs.

    Onions have shallow root systems and need consistent moisture and good weed control. Water weekly if weather is dry, and mulch to retain moisture and suppress weeds.",
    "earlyCrop": "March",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fmedia.tractorsupply.com%2Fis%2Fimage%2FTractorSupplyCompany%2F20161130-tsc-winter-onions-garden%3F%24500%24&imgrefurl=https%3A%2F%2Fwww.tractorsupply.com%2Fout-here_articles_garden_winter-onions&docid=FYRrVu1sPMuudM&tbnid=IN7OGETxU7r4jM%3A&vet=10ahUKEwiO1uuY14PcAhXkIzQIHa2MDp8QMwjeASgKMAo..i&w=500&h=332&bih=752&biw=1409&q=onion%20garden&ved=0ahUKEwiO1uuY14PcAhXkIzQIHa2MDp8QMwjeASgKMAo&iact=mrc&uact=8"
  },
  {
    "name": "Pepper",
    "synonyms": "bell peppers,peppers, hot peppers",
    "description": "Sometimes peppers are a challenge to grow in cooler areas. The many varieties of sweet and hot peppers thrive on full sun, warm weather, well-drained soil and modest fertility.",
    "care": "moderate",
    "height": "1 to 3 feet",
    "spread": "1 to 3 feet",
    "maintenance": "Sow seeds indoors, 1/4 inch deep in flats, peat pots or cellpacks, 8-10 weeks before you anticipate transplanting outside. Seed germinates best when soil temperature is 80 F or higher. It will not germinate below 55 F.
    Keep plants indoors in a warm (70 F during the day, 65 F at night), sunny location. Lack of light will produce leggy, unproductive transplants.

    Don't be in a rush to transplant outside. Cold temperatures can weaken plants and they may never fully recover. A few days at 60 F to 65 F with reduced water will help harden plants and reduce transplant shock. Over-hardened plants grow slowly after transplanting.

    Set plants out 2 to 3 weeks after average last frost when the soil has warmed and the weather has settled. Plant them 12 to 24 inches apart, in rows 24 to 36 inches apart, or spaced about 14 to 16 inches apart in raised beds.

    Use black plastic and/or row covers to speed soil warming and early growth. Use caution with row covers not to overheat plants and cause them to drop their blossoms.

    If not using black plastic, mulch plants after they are well established and the soil has warmed to retain moisture and control weeds.

    Peppers can be temperamental when it comes to setting fruit if temperatures are too hot or too cool. Nighttime temperatures below 60 F or above 75 F can reduce fruit set.

    Too much nitrogen fertilizer may promote lush vegetative growth but fewer fruits. Peppers usually responds well to phosphorus fertilizer.

    Stake tall varieties for earlier and heavier harvest.

    Peppers need even moisture for best performance. An even supply can reduce blossom end rot, a disorder caused by lack of calcium.

    Do not plant in same spot more than once every 4 years.",
    "earlyCrop": "April",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fhgtvhome.sndimg.com%2Fcontent%2Fdam%2Fimages%2Fhgtv%2Fstock%2F2018%2F4%2F1%2F0%2Fshutterstock_Denis-Pogostin_110418200_bell-peppers.jpg.rend.hgtvcom.616.462.suffix%2F1522694512493.jpeg&imgrefurl=https%3A%2F%2Fwww.hgtv.com%2Foutdoors%2Fgardens%2Fgarden-to-table%2Fgarden-to-table-peppers&docid=2dVLErOvvMKcqM&tbnid=fC7g6FQlCNTBNM%3A&vet=10ahUKEwiL_eCi14PcAhXEIjQIHXEJAacQMwi7ASgBMAE..i&w=616&h=462&bih=752&biw=1409&q=peppers%20garden&ved=0ahUKEwiL_eCi14PcAhXEIjQIHXEJAacQMwi7ASgBMAE&iact=mrc&uact=8"
  },
  {
    "name": "Spinach",
    "description": "This easy-to-grow, nutritious, cool-season crop is among the first greens ready to harvest. But plant it early because it’s quick to turn bitter and go to seed (bolt) as the weather warms and the days lengthen. Dark green color and handsome texture of savoyed varieties are great for edible landscaping.",
    "care": "moderate",
    "height": "0.5 to 1 feet",
    "spread": "0.5 to 1 feet",
    "maintenance": "As soon as you can work the soil in spring, sow seed ½ inch deep, 1 inch apart in rows 12 to 18 inches apart (or broadcast seed across a wider area). Thin to 2- to 6-inch spacings. Closer spacings can stress plants and cause them to go to seed (bolt) sooner.
    Early planting is critical as dry soil, heat and lengthening days also encourage bolting. Later plantings benefit from some light shade from other crops. Follow early plantings with warm-season crops such as tomatoes or beans.

    Make succession plantings every week or two until average last frost date. Use bolt-resistant varieties for later plantings. Sow again in mid- to late summer for fall harvest. Seeds do not germinate well in warm soil, so increase seeding rate to compensate. Or pre-germinate seeds by placing them between sheets of moist paper towel in a plastic bag and refrigerating until they sprout.

    Spinach seedlings are difficult to transplant. For spring crops, start inside only if your garden stays too wet in spring to allow direct seeding. Start transplants inside about 3 to 6 weeks before last frost.

    Spinach is shallow-rooted and requires consistent moisture to prevent bolting. Water to keep soil moist. Mulch after plants are well established to maintain moisture and suppress weeks. Use floating row covers to prevent insect damage.

    Do not overfertilize with nitrogen. Only apply supplemental fertilizer if leaves are pale green. Add lime to make sure pH is at least 6.0. You should suspect that your soil is too acid if germination is poor and leaf tips and margins are yellow or brown.

    Plant in fall and mulch heavily for early spring crop.",
    "earlyCrop": "March",
    "lateCrop": "August",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fbprassets.s3.amazonaws.com%2Fblogfiles%2Fassets%2Fimages%2Fpost%2FBody%2520Pics%2F04-19-17_images%2Frows-of-spinach-in-garden.jpg&imgrefurl=https%3A%2F%2Fwww.bestpickreports.com%2Fblog%2Fpost%2Fgardening-to-feed-your-family-year-round&docid=j2-HsRffIBc-FM&tbnid=MfarASoQxQB05M%3A&vet=10ahUKEwi70L2u14PcAhXNGTQIHe7cCWMQMwi-ASgZMBk..i&w=600&h=400&bih=752&biw=1409&q=spinach%20garden&ved=0ahUKEwi70L2u14PcAhXNGTQIHe7cCWMQMwi-ASgZMBk&iact=mrc&uact=8"
  },
  {
    "name": "Squash",
    "synonyms": "summer squash, zucchini, yellow squash, patty pan squash",
    "description": "Summer squash comes in a variety of shapes and colors. Bush varieties take up relatively little space, and if kept picked will keep producing right up to frost.",
    "care": "easy",
    "height": "1 to 3 feet",
    "spread": "2 to 4 feet",
    "maintenance": "Squash like warm soil and are very sensitive to frost. So don’t be in a rush to plant early in spring. Wait until danger of frost has passed and soil has warmed to about 70 F, or about 2 weeks after the last frost date.
    Direct seed ½ to 1 inch deep into hills (which warm and drain earlier in the season) or rows. Sow 4 to 5 seeds per hill. Space hills 3 to 4 feet apart. When the plants are 2 to 3 inches tall, thin to 2 to 3 plants per hill by snipping off unwanted plants without disturbing the roots of the remaining ones. In rows, sow seeds 4 inches apart in rows 4 to 5 feet apart. Snip off plants to thin to one plant every 12 to 24 inches.

    For extra early crops, start inside in 2- to 3-inch pots or cells 3 to 4 weeks before transplanting outside. Sow 3 or 4 seeds per pot and thin to one or two plants by snipping off the weaker plants to avoid damaging the roots of those that remain. Harden off by cutting back on water and reducing temperature before transplanting. Plant transplants out in the garden about 1 to 2 feet apart after all danger of frost has passed.

    To hasten first harvest by as much as 2 weeks, use black plastic mulch to warm soil before direct seeding or transplanting. Early fruits are sometimes wrinkled, turn black or rot due to poor pollination.

    At the end of the season, remove or till in vines to reduce mildew. Use row covers to protect plants early in the season and to prevent insect problems. Remove cover before flowering to allow pollination by insects or when hot weather arrives.

    Mulching plants helps retain moisture and suppress weeds. Mounding soil around the base of the plants can discourage squash borers from laying eggs.",
    "earlyCrop": "April",
    "image": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fi.pinimg.com%2F736x%2Fa6%2Fe9%2Ff4%2Fa6e9f4201d29803c8af0a4e7bf703de6--winter-season-fall-winter.jpg&imgrefurl=https%3A%2F%2Fwww.pinterest.com%2Ftsjogren%2Fgardening%2F&docid=UVW0jfUJyqbbdM&tbnid=pBGXfJt6tQocHM%3A&vet=10ahUKEwjHktnG14PcAhWHIDQIHSzYAy4QMwjCASgOMA4..i&w=733&h=520&bih=752&biw=1409&q=squash%20garden&ved=0ahUKEwjHktnG14PcAhWHIDQIHSzYAy4QMwjCASgOMA4&iact=mrc&uact=8"
  },
  {
    "name": "Tomato",
    "description": "The most popular garden vegetable crop, tomatoes come in a wide range of sizes, shapes and colors. Choose determinate varieties for early harvest or cool conditions. Compact varieties are also good choices for containers and planting in flower beds.",
    "care": "moderate",
    "height": "2 to 6 feet",
    "spread": "2 to 6 feet",
    "maintenance": "If you purchase transplants, look for sturdy, short, dark green plants. Avoid plants that are tall, leggy, or yellowish, or have started flowering. Transplants that are too mature often stall after transplanting while younger, smaller plants pass them by, producing earlier and more fruit.
    Starting your own plants from seed gives you more choices of which variety to grow. But if you start your own plants, be sure you have a place where they can get enough light. Even a sunny, south-facing window is barely adequate. Consider using a grow light to supplement sunlight.

    Don’t start plants too early. Sow seeds indoors 6 to 8 weeks before transplanting outside. Plant them 1/8 inch deep in sterile seed starting mix in flats or cells. Seeds germinate best at 75 F to 90 F. Then grow transplants at about 70 F.

    Don’t rush to transplant, either. Cold soil and air temperatures can stress plants. Wait at least a week or two after the last frost. Nighttime temperatures should be consistently above 45 F. Use black plastic mulch to warm soil and/or row covers, hot caps or other protection to keep plants warm early in the season. Remove covers whenever temperatures exceed 85 F.

    Harden off plants before transplanting by reducing water and fertilizer, not by exposing to cold temperatures, which can stress them and stunt growth. Transplants exposed to cold temperatures (60 F to 65 F day and 50 F to 60 F night) are more prone to catfacing.

    Space transplants:

    12 to 24 inches apart for determinate varieties

    14 to 20 inches apart for staked indeterminate varieties

    24 to 36 inches apart for unstaked indeterminate varieties

    Unlike most plants, tomatoes do better if planted deeper than they were grown in containers. Set them in the ground so that the soil level is just below the lowest leaves. Roots will form along the buried stem, establishing a stronger root system.

    To reduce root disease risk, don't plant on soils that have recently grown tomatoes, potatoes, peppers or eggplant for at least two years.

    Mulch plants after the soil has warmed up to maintain soil moisture and suppress weeds. Tomatoes need a consistent supply of moisture. If it rains less than 1 inch per week, water to make up the difference.

    Many factors (in addition to your choice of variety) affect total yield, first harvest and fruit quality. Raised beds, black plastic mulch and providing consistent moisture by watering or through drip irrigation are good ways to improve all three.

    How you provide support to plants can also affect performance. Determinate varieties do not need staking. But staking and pruning indeterminate varieties can hasten first harvest by a week or more, improve fruit quality, keep fruit cleaner, and make harvest easier. Staking and pruning usually reduces total yield, but fruits will tend to be larger. Staked and pruned plants are also more susceptible to blossom end rot and sunscald. Allowing indeterminate varieties to sprawl reduces labor, but takes up more space and plants are more prone to disease.

    Wooden tomato stakes are typically about 6 feet long and 1 ½ inch square, but you can use similar materials. Drive stakes at least 8 to 10 inches deep at or soon after transplanting so as not to damage roots.

    Prune tomatoes to one or two vigorous stems by snapping off “suckers” (stems growing from where leaf stems meet the main stem) when they are 2 to 4 inches long. Tie stems to stake with soft string, twine or cloth, forming a figure-8 with the stem in one loop and the stake in the other. This gives the stem room to expand without being constricted. Start about 8 to 12 inches above the ground and continue to tie at similar intervals as the plant grows. As an alternative to using individual stakes, grow several plants in a row between heavy-duty stakes or posts spaced about 4 feet apart, and use twine to weave in and out around posts and plants.

    Growing tomatoes in cages is a good compromise between labor-intensive staking and just letting them sprawl. You can purchase tomato cages at your local garden center, or simply bend a 6-foot-long piece of 4- to 6-inch wire mesh into a cylinder about 22 inches in diameter. (Cattle fencing or concrete reinforcing wire mesh work well for this.) Place cage around plants soon after transplanting and anchor with stakes.

    Avoid excessive N applications, which can cause excessive foliage and poor fruit set. Also avoid using fresh manure or high nitrogen fertilizers (those with three or more times nitrogen than phosphorus or potassium). Poor fruit set can also be caused by heavy rainfall or temperatures that are either too high (above 90 F) or too low (below 55 F).

    On most soils, you can sidedress about 1/2 cup of 5-10-5 per plant and work shallowly into the top inch of soil when fruits are about 1 inch in diameter and again when harvest begins.

    To avoid other common tomato problems:

    Keep soil evenly moist to prevent blossom end rot. This can also help prevent cracking when fruit absorbs water too fast after heavy rain following dry conditions.

    Do not remove leaves that shade fruit to prevent sunscald.

    Catfacing (misshapen, deformed fruit) is caused by incomplete pollination, usually due to cold weather. Don’t rush to transplant until weather has stabilized and soil is warm.",
    "earlyCrop": "April",
    "image": "https://www.google.com/imgres?imgurl=http%3A%2F%2Fwww.homeandgarden.green%2Fwp-content%2Fuploads%2F2017%2F06%2FThe-Taste-Revelation-tomatoes.jpg&imgrefurl=http%3A%2F%2Fwww.homeandgarden.green%2Fhow-to-grow-a-tomato-garden%2F&docid=94rmSWGKm1_qFM&tbnid=lDbbpH3vnkytMM%3A&vet=10ahUKEwjC5fiD2IPcAhUpFzQIHamqAJcQMwi3AigKMAo..i&w=2240&h=1488&bih=752&biw=1409&q=tomato%20garden&ved=0ahUKEwjC5fiD2IPcAhUpFzQIHamqAJcQMwi3AigKMAo&iact=mrc&uact=8"
  }
]
